Revit 2027 API
HemisphericalLightDistribution Methods
The HemisphericalLightDistribution type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the LightDistribution derived object.
(Inherited from LightDistribution)
Dispose
(Inherited from LightDistribution)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
HemisphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace